tap "amberframework/amber"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
brew "autoconf"
brew "automake"
brew "coreutils"
brew "cask"
brew "crystal"
brew "python@3.9"
brew "crystal-icr"
brew "gh"
brew "git"
brew "glow"
brew "gnupg"
brew "imagemagick"
brew "mdcat"
brew "neofetch"
brew "node"
brew "nvm"
brew "openjdk"
brew "php"
brew "pyenv"
brew "ruby-build"
brew "rbenv"
brew "tmux"
brew "tree"
brew "vim"
brew "yarn"
brew "zlib"
brew "amberframework/amber/amber"
brew "heroku/brew/heroku"
cask "font-3270-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-hack-nerd-font"
cask "font-heavy-data-nerd-font"
cask "font-hurmit-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-lekton-nerd-font"
cask "font-liberation-nerd-font"
cask "font-monoid-nerd-font"
cask "font-mononoki-nerd-font"
cask "font-press-start-2p"
cask "font-shure-tech-mono-nerd-font"
