tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
# Official Amazon AWS command-line interface
brew "awscli"
# Emacs dependency management
brew "cask"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Render markdown on the CLI
brew "glow"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Show markdown documents on text terminals
brew "mdcat"
# MySQL Client
brew "mysql"
# Manage multiple Node.js versions
brew "nvm"
# Ruby version manager
brew "rbenv"
# Login and retrieve AWS temporary credentials using a SAML IDP
brew "saml2aws"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vi 'workalike' with many additional features
brew "vim"
# JavaScript package manager
brew "yarn"
# GPU-accelerated terminal emulator
cask "alacritty"
# ALL THE FONTS
cask "font-3270-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-hack-nerd-font"
cask "font-heavy-data-nerd-font"
cask "font-hurmit-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-lekton-nerd-font"
cask "font-liberation-nerd-font"
cask "font-monoid-nerd-font"
cask "font-mononoki-nerd-font"
cask "font-press-start-2p"
cask "font-shure-tech-mono-nerd-font"
cask "font-terminess-ttf-nerd-font"
cask "font-terminus"
# Window manager
# cask "rectangle"
