# Brewfile syntax overview: https://homebrew-file.readthedocs.io/en/latest/usage.html
# TODO: Modularize this file using "file" syntax

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"

# Official Amazon AWS command-line interface
brew "awscli"
# extended cat clone
brew "bat"
# Emacs dependency management
brew "cask"
# The wisdom of the cow
brew "cowsay"
# Use brew managed curl until Apple patches built-in curl
brew "curl"
# Strings to ASCII art
brew "figlet"
brew "toilet"
# ffmpeg is a cli audio/video processing tool
brew "ffmpeg"
# fzf fuzzy find utility
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Render markdown on the CLI
brew "glow"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Java SDK 17
brew "openjdk@17"
# Show markdown documents on text terminals
brew "mdcat"
# MySQL Client
brew "mysql"
# Manage multiple Node.js versions
brew "nvm"
# Source code analyzer (installing for APEX)
# brew "pmd"
brew "pmd7", args: ["build-from-source"] # Currently using a custom, local formula to pull from latest release and map to pmd
# Ruby version manager
brew "rbenv"
# Search tool like grep, but better
brew "ripgrep"
# Login and retrieve AWS temporary credentials using a SAML IDP
brew "saml2aws"
# Terminal multiplexer
brew "tmux"
# Ibotta SOPS tool
brew "Ibotta/public/sopstool"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# terraform runtime
brew "tfenv"
# Vim Linter
brew "vint"
# Vi 'workalike' with many additional features
brew "vim"
# JavaScript package manager
# brew "yarn"
# GPU-accelerated terminal emulator
cask "alacritty"
# iterm2
cask "iterm2"
# Insomnia REST API Client
cask "insomnia"
# ALL THE FONTS
cask "font-3270-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-hack-nerd-font"
cask "font-heavy-data-nerd-font"
cask "font-hurmit-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-lekton-nerd-font"
cask "font-liberation-nerd-font"
cask "font-monoid-nerd-font"
cask "font-mononoki-nerd-font"
cask "font-press-start-2p"
cask "font-shure-tech-mono-nerd-font"
cask "font-terminess-ttf-nerd-font"
cask "font-terminus"
# Window manager
cask "rectangle"
# Better VS Code
cask "vscodium"
# DataGrip
cask "datagrip"
# Obsidian Markdown Notes
cask "obsidian"
# GNU Image Manupulation Program
cask "gimp"
# Notion notes app
# cask "notion"
# Salesforce DX CLI
cask "sfdx"
